Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalPanelNotPlanar Property
 Analytical Panel is not planar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AnalyticalPanelNotPlanar { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalPanelNotPlanar As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AnalyticalPanelNotPlanar {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace